tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Library for command-line editing
brew "readline"
# Official Amazon AWS command-line interface
brew "awscli"
# Cross-platform make
brew "cmake"
# Command-line fuzzy finder written in Go
brew "fzf"
# TMUX
brew "tmux"
# GNU compiler collection
brew "gcc"
# Fast, highly customisable system info script
brew "neofetch"
# Platform built on V8 to build network applications
brew "node"
# Python version management
brew "uv"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Access X11 clipboards from the command-line
brew "xclip"
# General-purpose lossless data-compression library
brew "zlib"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Cross-shell prompt for astronauts
brew "starship"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3", link: false
# Object-relational database system
brew "postgresql@14"
# Command-line interface for SQLite
brew "sqlite"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Modern, maintained replacement for ls
brew "eza"
# A better cd command
brew "zoxide"
# Simple terminal UI for git commands
brew "lazygit"
# window manager
cask nikitabobko/tap/aerospace

# App to build and share containerized applications and microservices
cask "docker"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-symbols-only-nerd-font"
# Grammarly for desktop
cask "grammarly-desktop"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
